lucasmoraeseng/STM3205P/3.Firmware/STM3205P/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
// ADC 1   -> Output Voltage Measure
// ADC 2   -> Output Current Measure
// TIM 1   -> PWM to fan control
// TIM 2   -> Periodic interrupt for display update 1ms
// TIM 3   -> Periodic interrupt for ADC Measure
// USART 1 -> Serial communication
// SPI 1   -> Communication with DAC8830

/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "DAC8830.h"
#include "RingBuffer.h"
#include "display.h"
#include "flash.h"
#include "keyboard.h"
#include "stm32f1xx_hal.h"


/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */
Display_t display;
ADC_ChannelConfTypeDef cfgVoltageADC;
ADC_ChannelConfTypeDef cfgCurrentADC;
ADC_ChannelConfTypeDef cfgTemperatureADC;

uint32_t frameCounter = 0;

uint8_t enChangeValue = 0;
uint8_t digitToChange = 0;
uint32_t startBlink = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC1_Init(void);
static void MX_ADC2_Init(void);
static void MX_TIM1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM2_Init(void);
static void MX_SPI1_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    if(htim->Instance == TIM1)
    {
    }
    else if(htim->Instance == TIM2)
    {
        display.frame_cnt++;
        if(display.frame_cnt % 512 == 0)
        {
            display.blink_state = !display.blink_state;
        }

        display_update(&display);
    }
    else if(htim->Instance == TIM3)
    {
    }
}

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{

    if(hadc->Instance == ADC1)
    {
        uint16_t value1 = HAL_ADC_GetValue(&hadc1);
        // RingBuffer_Put(&RBVoltage,(RBDataType) value1);
    }
    else if(hadc->Instance == ADC2)
    {
        uint16_t value2 = HAL_ADC_GetValue(&hadc2);
        // RingBuffer_Put(&RBCurrent,(RBDataType) value2);
    }
}

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{

    /* USER CODE BEGIN 1 */

    cfgVoltageADC.Channel = ADC_CHANNEL_1;
    cfgVoltageADC.Rank = ADC_REGULAR_RANK_1;
    cfgVoltageADC.SamplingTime = ADC_SAMPLETIME_1CYCLE_5;

    cfgCurrentADC.Channel = ADC_CHANNEL_2;
    cfgCurrentADC.Rank = ADC_REGULAR_RANK_1;
    cfgCurrentADC.SamplingTime = ADC_SAMPLETIME_1CYCLE_5;

    cfgTemperatureADC.Channel = ADC_CHANNEL_3;
    cfgTemperatureADC.Rank = ADC_REGULAR_RANK_1;
    cfgTemperatureADC.SamplingTime = ADC_SAMPLETIME_1CYCLE_5;
    Flash_ReadSettings(&flashData);

    /* USER CODE END 1 */

    /* MCU Configuration--------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* USER CODE BEGIN Init */
    display_Init(&display);

    display.ledM1 = true;

    actualData.Voltage = flashData.memory1.Voltage;
    actualData.Current = flashData.memory1.Current;
    actualData.OCP = flashData.memory1.OCP;
    actualData.OVP = flashData.memory1.OVP;

    display_PrepareDataACCX3(&display, actualData);

    // display.blink_display = 2;
    // display.blink_index = 1;

    /* USER CODE END Init */

    /* Configure the system clock */
    SystemClock_Config();

    /* USER CODE BEGIN SysInit */

    /* USER CODE END SysInit */

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_ADC1_Init();
    MX_ADC2_Init();
    MX_TIM1_Init();
    MX_USART1_UART_Init();
    MX_TIM2_Init();
    MX_SPI1_Init();
    /* USER CODE BEGIN 2 */

    HAL_ADC_ConfigChannel(&hadc1, &cfgVoltageADC);
    HAL_ADC_ConfigChannel(&hadc2, &cfgCurrentADC);

    HAL_TIM_Base_Start_IT(&htim2); // Timer with interruption
    HAL_ADC_Start_IT(&hadc1);      // Start ADC1 with interruption
    HAL_ADC_Start_IT(&hadc2);      // Start ADC2 with interruption

    /* USER CODE END 2 */

    /* Infinite loop */
    /* USER CODE BEGIN WHILE */
    while(1)
    {
        PanelRead();

        if(display.ledOUT)
        {
        }
        else
        {
            if(Keyboard.Keys.Bits.M1 && !KeyboardPrev.Keys.Bits.M1)
            {
                KeyboardPrev.Keys.Bits.M1 = 1;
            }
            else if(!Keyboard.Keys.Bits.M1 && KeyboardPrev.Keys.Bits.M1)
            {
                display.ledM2 = false;
                display.ledM3 = false;
                display.ledM4 = false;
                display.ledM5 = false;
                display.ledM1 = true;
                KeyboardPrev.Keys.Bits.M1 = 0;
                actualData.Voltage = flashData.memory1.Voltage;
                actualData.Current = flashData.memory1.Current;
                actualData.OCP = flashData.memory1.OCP;
                actualData.OVP = flashData.memory1.OVP;

                display_PrepareDataACCX3(&display, actualData);
            }

