lucasmoraeseng/STM3205P/3.Firmware/STM3205P/Core/Src/main.c
            if(Keyboard.Keys.Bits.M2 && !KeyboardPrev.Keys.Bits.M2)
            {
                KeyboardPrev.Keys.Bits.M2 = 1;
            }
            else if(!Keyboard.Keys.Bits.M2 && KeyboardPrev.Keys.Bits.M2)
            {
                display.ledM1 = false;
                display.ledM3 = false;
                display.ledM4 = false;
                display.ledM5 = false;
                display.ledM2 = true;
                KeyboardPrev.Keys.Bits.M2 = 0;
                actualData.Voltage = flashData.memory2.Voltage;
                actualData.Current = flashData.memory2.Current;
                actualData.OCP = flashData.memory2.OCP;
                actualData.OVP = flashData.memory2.OVP;

                display_PrepareDataACCX3(&display, actualData);
            }

            if(Keyboard.Keys.Bits.M3 && !KeyboardPrev.Keys.Bits.M3)
            {
                KeyboardPrev.Keys.Bits.M3 = 1;
            }
            else if(!Keyboard.Keys.Bits.M3 && KeyboardPrev.Keys.Bits.M3)
            {
                display.ledM1 = false;
                display.ledM2 = false;
                display.ledM4 = false;
                display.ledM5 = false;
                display.ledM3 = true;
                KeyboardPrev.Keys.Bits.M3 = 0;
                actualData.Voltage = flashData.memory3.Voltage;
                actualData.Current = flashData.memory3.Current;
                actualData.OCP = flashData.memory3.OCP;
                actualData.OVP = flashData.memory3.OVP;

                display_PrepareDataACCX3(&display, actualData);
            }

            if(Keyboard.Keys.Bits.M4 && !KeyboardPrev.Keys.Bits.M4)
            {
                KeyboardPrev.Keys.Bits.M4 = 1;
            }
            else if(!Keyboard.Keys.Bits.M4 && KeyboardPrev.Keys.Bits.M4)
            {
                display.ledM1 = false;
                display.ledM2 = false;
                display.ledM3 = false;
                display.ledM5 = false;
                display.ledM4 = true;
                KeyboardPrev.Keys.Bits.M4 = 0;
                actualData.Voltage = flashData.memory4.Voltage;
                actualData.Current = flashData.memory4.Current;
                actualData.OCP = flashData.memory4.OCP;
                actualData.OVP = flashData.memory4.OVP;

                display_PrepareDataACCX3(&display, actualData);
            }

            if(Keyboard.Keys.Bits.OCP && !KeyboardPrev.Keys.Bits.OCP)
            {
                KeyboardPrev.Keys.Bits.OCP = 1;
            }
            else if(!Keyboard.Keys.Bits.OCP && KeyboardPrev.Keys.Bits.OCP)
            {
                KeyboardPrev.Keys.Bits.OCP = 0;
                actualData.OCP = ~actualData.OCP;
                display.ledOCP = actualData.OCP;
            }

            if(Keyboard.Keys.Bits.OVP && !KeyboardPrev.Keys.Bits.OVP)
            {
                KeyboardPrev.Keys.Bits.OVP = 1;
            }
            else if(!Keyboard.Keys.Bits.OVP && KeyboardPrev.Keys.Bits.OVP)
            {
                KeyboardPrev.Keys.Bits.OVP = 0;
                actualData.OVP = ~actualData.OVP;
                display.ledOVP = actualData.OVP;
            }

            if(Keyboard.Keys.Bits.VoltageCurrent && !KeyboardPrev.Keys.Bits.VoltageCurrent)
            {
                KeyboardPrev.Keys.Bits.VoltageCurrent = 1;
            }
            else if(!Keyboard.Keys.Bits.VoltageCurrent && KeyboardPrev.Keys.Bits.VoltageCurrent)
            {
                KeyboardPrev.Keys.Bits.VoltageCurrent = 0;
                if(enChangeValue)
                {
                    if(display.blink_display == 1)
                    {
                        display.blink_display = 2;
                    }
                    else
                    {
                        display.blink_display = 1;
                    }
                }
                else
                {
                    enChangeValue = true;
                    display.blink_display = 1;
                    display.blink_index = 1;
                }

                startBlink = display.frame_cnt;
            }

            if(Keyboard.Keys.Bits.LeftArrow && !KeyboardPrev.Keys.Bits.LeftArrow)
            {
                KeyboardPrev.Keys.Bits.LeftArrow = 1;
            }
            else if(!Keyboard.Keys.Bits.LeftArrow && KeyboardPrev.Keys.Bits.LeftArrow)
            {
                KeyboardPrev.Keys.Bits.LeftArrow = 0;
                if(enChangeValue)
                {
                    if(display.blink_index > 1)
                    {
                        display.blink_index--;
                    }
                }
                startBlink = display.frame_cnt;
            }

            if(Keyboard.Keys.Bits.RightArrow && !KeyboardPrev.Keys.Bits.RightArrow)
            {
                KeyboardPrev.Keys.Bits.RightArrow = 1;
            }
            else if(!Keyboard.Keys.Bits.RightArrow && KeyboardPrev.Keys.Bits.RightArrow)
            {
                KeyboardPrev.Keys.Bits.RightArrow = 0;
                if(enChangeValue)
                {
                    if(display.blink_index < 4)
                    {
                        display.blink_index++;
                    }
                }
                startBlink = display.frame_cnt;
            }

            if(enChangeValue)
            {
                if(display.frame_cnt - startBlink > 10000)
                {
                    enChangeValue = false;
                    display.blink_display = 0;
                }

                if(Keyboard.DialValue != 0)
                {
                    startBlink = display.frame_cnt;
                    if(display.blink_display == 2)
                    {
                        if(actualData.Voltage < 32000 && Keyboard.DialValue > 0)
                        {
                            if(actualData.Voltage < 10000)
                            {
                                if(display.blink_index == 1)
                                {
                                    actualData.Voltage += 1000;
                                }
                                else if(display.blink_index == 2)
                                {
                                    actualData.Voltage += 100;
                                }
                                else if(display.blink_index == 3)
                                {
                                    actualData.Voltage += 10;
                                }
                                else if(display.blink_index == 4)
                                {
                                    actualData.Voltage += 1;
                                }
                            }
                            else
                            {
                                if(display.blink_index == 1)
                                {
                                    actualData.Voltage += 10000;
                                }
                                else if(display.blink_index == 2)
                                {
                                    actualData.Voltage += 1000;
                                }
                                else if(display.blink_index == 3)
                                {
                                    actualData.Voltage += 100;
                                }
                                else if(display.blink_index == 4)
                                {
                                    actualData.Voltage += 10;
                                }
                            }
                        }
                        else if(actualData.Voltage > 0 && Keyboard.DialValue < 0)
                        {
                            if(actualData.Voltage < 10000)
                            {
                                if(display.blink_index == 1)
                                {
                                    actualData.Voltage -= 1000;
                                }
                                else if(display.blink_index == 2)
                                {
                                    actualData.Voltage -= 100;
                                }
                                else if(display.blink_index == 3)
                                {
                                    actualData.Voltage -= 10;
                                }
                                else if(display.blink_index == 4)
                                {
                                    actualData.Voltage -= 1;
                                }
                            }
                            else
                            {
                                if(display.blink_index == 1)
                                {
                                    actualData.Voltage -= 10000;
                                }
                                else if(display.blink_index == 2)
                                {
                                    actualData.Voltage -= 1000;
                                }
                                else if(display.blink_index == 3)
                                {
                                    actualData.Voltage -= 100;
                                }
                                else if(display.blink_index == 4)
                                {
                                    actualData.Voltage -= 10;
                                }
                            }
                        }
                    }
                    else if(display.blink_display == 1)
                    {
                        if(actualData.Current < 5000 && Keyboard.DialValue > 0)
                        {
                            if(display.blink_index == 1)
                            {
                                actualData.Current += 1000;
                            }
                            else if(display.blink_index == 2)
                            {
                                actualData.Current += 100;
                            }
                            else if(display.blink_index == 3)
                            {
                                actualData.Current += 10;
                            }
                            else if(display.blink_index == 4)
                            {
                                actualData.Current += 1;
                            }
                        }
                        else if(actualData.Current > 0 && Keyboard.DialValue < 0)
                        {
                            if(display.blink_index == 1)
                            {
                                actualData.Current -= 1000;
                            }
                            else if(display.blink_index == 2)
                            {
                                actualData.Current -= 100;
                            }
                            else if(display.blink_index == 3)
                            {
                                actualData.Current -= 10;
                            }
                            else if(display.blink_index == 4)
                            {
                                actualData.Current -= 1;
                            }
                        }
                    }

                    Keyboard.DialValue = 0;
                    if(actualData.Voltage > 32000)
                    {
                        actualData.Voltage = 32000;
                    }
                    if(actualData.Current > 5000)
                    {
                        actualData.Current = 5000;
                    }

                    display_PrepareDataACCX3(&display, actualData);
                }
            }
        }

        // display.ledM2 = Keyboard.Keys.Bits.M2;
        // display.ledM3 = Keyboard.Keys.Bits.M3;
        // display.ledM4 = Keyboard.Keys.Bits.M4;
        // display.ledM5 = Keyboard.Keys.Bits.LeftArrow;

        // display.ledOUT = Keyboard.Keys.Bits.OnOff;
        // display.ledCC = Keyboard.Keys.Bits.Lock;
        // display.ledOCP = Keyboard.Keys.Bits.OCP;
        // display.ledOVP = Keyboard.Keys.Bits.OVP;
        // display.ledCV = Keyboard.Keys.Bits.RightArrow;

        /* USER CODE END WHILE */

